const allQuestions = [
    { icon: "🔐", q: "Пароль 'myadmin2011' — це надійний захист?", options: [{ text: "Ні, легко підібрати", score: 2 }, { text: "Для чогось неважливого підійде", score: 1 }, { text: "Так, там є цифри", score: 0 }] },
    { icon: "🔐", q: "Пароль 'F(#*28?цвwui3' — це надійний захист?", options: [{ text: "Так, це виглядає незламно", score: 2 }, { text: "Він складний, не підходить", score: 0 }] },
    { icon: "🔐", q: "Який PIN код на телефон виклядає більш складним '1221' чи '3704'?", options: [{ text: "1221", score: 0 }, { text: "3704", score: 2 }] },
    { icon: "🛰️", q: "Пропонують 'безкоштовні монети' в обмін на логін. Твоя реакція?", options: [{ text: "Заблокую шахрая", score: 2 }, { text: "Спробую, раптом правда", score: 0 }] },
    { icon: "🤳", q: "Чи можна публікувати фото з домашньою адресою?", options: [{ text: "Ні, це небезпечно", score: 2 }, { text: "Так, друзі мають знати", score: 0 }] },
    { icon: "👾", q: "Безпечно завантажувати ігри з неофіційних сайтів?", options: [{ text: "Ні, там можуть бути віруси", score: 2 }, { text: "Так, вони безкоштовні", score: 0 }] },
    { icon: "🧠", q: "Як перевірити новину в мережі на правдивість?", options: [{ text: "Подивлюсь на офіційні джерела", score: 2 }, { text: "Повірю, якщо багато лайків", score: 0 }] },
    { icon: "🛡️", q: "Що таке двофакторна автентифікація?", options: [{ text: "Додатковий код підтвердження", score: 2 }, { text: "Це коли два паролі", score: 0 }] },
    { icon: "🕶️", q: "Чи може незнайомець бути не тим, за кого себе видає?", options: [{ text: "Так, це часто буває", score: 2 }, { text: "Ні, фото ж справжнє", score: 0 }] },
    { icon: "📱", q: "Програма 'Погода' хоче доступ до мікрофона, та камери. Це нормально?", options: [{ text: "Ні, це підозріло", score: 2 }, { text: "Так, вона розумна", score: 0 }] },
    { icon: "🧊", q: "Ти знайшов флешку біля школи. Що з нею робити?", options: [{ text: "Віддам вчителю, не вмикаючи", score: 2 }, { text: "Вставлю в комп", score: 0 }] },
    { icon: "📱", q: "Телефон пропонує покращити безпеку у налаштуваннях", options: [{ text: "Нецікаво, відмінити", score: 0 }, { text: "Перейду у налаштування та увікну", score: 2 }, { text: "Можливо вірус. Перезавантажу", score: 0 }] },
    { icon: "📡", q: "Безпечно вводити дані банківської карти через відкритий Wi-Fi?", options: [{ text: "Ні, дані можуть вкрасти", score: 2 }, { text: "Так, якщо зв'язок швидкий", score: 0 }] },
    { icon: "⚡", q: "Пишуть, що акаунт заблокують, якщо не перейдеш за лінком за 5 хв. Це..", options: [{ text: "Маніпуляція та фішинг", score: 2 }, { text: "Служба підтримки поспішає", score: 0 }] },
    { icon: "🕵️‍♂️", q: "Лист від 'техпідтримки' з посиланням mikrosoft-security.com", options: [{ text: "Це фішинг. Повідомити про нього", score: 2 }, { text: "Ігнорую", score: 1 }, { text: "Клікну, оновити — важливо", score: 0 }] },
    { icon: "🎭", q: "Відео зі знаменитістю з дивними артефактами зображення. Що це?", options: [{ text: "Дипфейк, застережу друзів", score: 2 }, { text: "Дипфейк, проігнорую", score: 1 }, { text: "Просто поганий мікрофон", score: 0 }] },
    { icon: "📶", q: "Ти в Метро. Чи безпечно передавати файли через публічний Wi-Fi?", options: [{ text: "Ні, небезпечно", score: 2 }, { text: "Так, тільки з VPN", score: 1 }, { text: "Так, зручно", score: 0 }] },
    { icon: "📸", q: "Безпечно виставляти квитки з QR-кодом у сторіз?", options: [{ text: "Ні, код можуть вкрасти", score: 2 }, { text: "Так, просто картинка", score: 0 }] },
    { icon: "🔐", q: "Друг просить проголосувати за посиланням у Інстаграм. Дії?", options: [{ text: "Злам, заблокую до відновлення", score: 2 }, { text: "Запитую його через інші сервіси, чи зателефоную, чи не взламали його", score: 2 }, { text: "Звісно, допоможу!", score: 0 }] },
    { icon: "🎮", q: "Гра '3-в-ряд' просить доступ до камери та локації. Ок?", options: [{ text: "Ні, заблокую надлишкові доступи", score: 2 }, { text: "Тимчасовий доступ", score: 1 }, { text: "Так. Зараз всі ігри так роблять", score: 0 }] },
    { icon: "🤖", q: "Чи можна давати ШІ особисті дані для домашки?", options: [{ text: "Ні, дані стають публічними", score: 2 }, { text: "Видалю чат після", score: 0 }, { text: "Так, AI — мій друг", score: 0 }] },
    { icon: "🧐", q: "Розіграш iPhone 21 за 1000 грн. Як перевірити?", options: [{ text: "Перевірю URL та офіційні джерела", score: 2 }, { text: "Перешлю друзям", score: 0 }, { text: "Клікну", score: 0 }] },
    { icon: "🌐", q: "У кафе з відкритим Wi-Fi безпечно заходити в онлайн банк?", options: [{ text: "Ні, можуть вкрасти дані", score: 2 }, { text: "Тільки якщо є HTTPS", score: 1 }, { text: "Так, безкоштовний інет!", score: 0 }] },
    { icon: "📱", q: "Інтернет - це?", options: [{ text: "Канал в Тік-Ток", score: 0 }, { text: "Глобальна павутинна мережа", score: 2 }, { text: "Мережа маркетів, потипу Розетки", score: 0 }] },
    { icon: "🛡️", q: "Що таке кібергігієна?", options: [{ text: "Мити руки під кіберпанк мазику", score: 0 }, { text: "Фільтрувати те на які сайти хожу, що дивлюся, та що встановлюю", score: 2 }] },
    { icon: "🕶️", q: "Якщо ти зтикнешся з булінгом?", options: [{ text: "Повідомлю батьків, та вчителя за портеби", score: 2 }, { text: "Кину в ігнор, в блок ліст, напишу скаргу в саппорт", score: 1 }, { text: "Забулю у відповіль", score: -1 }] },
    { icon: "🎭", q: "Якщо тобі погрожують в Інтернеті?", options: [{ text: "Повідомлю батьків, вчителя та за портеби поліцію", score: 2 }, { text: "Кину в блок ліст, напишу скаргу в саппорт", score: 1 }, { text: "ДА ЦЕ Я ТЕБЕ ЗАРАЗ ЗНАЙДУ ТА....", score: -1 }] },
    { icon: "📱", q: "Телефон дивно себе поводить, сам вмикається, гріється та швидко розряджається", options: [{ text: "Можливо вірус, скачаю навсяк випадок антивірус", score: 2 }, { text: "Видалю зайві програми", score: 2 }, { text: "Який тепленький, погріємо ручки", score: 0 }] },
    { icon: "📱", q: "Ви побачили тік-ток де абсурдно змерзлі до посиніння люди закликають до протесту через відключення!", options: [{ text: "Вмевнитись що це не ШІ фейк", score: 2 }, { text: "Лайк!", score: 0 }, { text: "Підтримати протест", score: 0 }] },
    { icon: "📱", q: "Прилетіла SMS від monobonk.ua, що ви виграли в конкурсі кешбек+", options: [{ text: "Заблокую, непереходячі нікуди", score: 2 }, { text: "Тицну перейти", score: 0 }, { text: "🦀Мані мані мані!", score: 0 }] },

    {
        type: "image",
        icon: "🖼️",
        q: "Яке з цих фото — фейк, створений ШІ?",
        imgA: "img/photo11.jpg",
        imgB: "img/photo12.jpg",
        options: [
            { text: "Картинка А — ФЕЙК", score: 2 },
            { text: "Картинка Б — ФЕЙК", score: 0 },
            { text: "Картинка А та Б — ФЕЙК", score: 0 }
        ]
    },
    {
        type: "image",
        icon: "🖼️",
        q: "Яке з цих фото — фейк, створений ШІ?",
        imgA: "img/photo21.jpg",
        imgB: "img/photo22.jpg",
        options: [
            { text: "Картинка А — ФЕЙК", score: 0 },
            { text: "Картинка Б — ФЕЙК", score: 2 },
            { text: "Картинка А та Б — ФЕЙК", score: 0 }
        ]
    },
    {
        type: "image",
        icon: "🖼️",
        q: "Яке з цих фото — фейк, створений ШІ?",
        imgA: "img/photo31.jpg",
        imgB: "img/photo32.jpg",
        options: [
            { text: "Картинка А — ФЕЙК", score: 0 },
            { text: "Картинка Б — ФЕЙК", score: 0 },
            { text: "Картинка А та Б — ФЕЙК", score: 2 }
        ]
    },
];